{
  "users": [
    {
      "id": 1,
      "name": "Hunter Preast",
      "email": "hunter@email.com",
      "photo": "",
      "bio": "Skater from Nashville trying to improve and learn some new things."
    },
    {
      "email": "Bryan@email.com",
      "name": "Bryan Ford",
      "id": 2,
      "photo": "",
      "bio": "Sponsored skater trying to get more organized."
    },
    {
      "email": "ethan@email.com",
      "name": "Ethan Mathis",
      "id": 3,
      "photo": "",
      "bio": ""
    },
    {
      "email": "kwalks@email.com",
      "name": "Kyle Walker",
      "id": 4,
      "photo": "",
      "bio": ""
    },
    {
      "email": "chris@email.com",
      "name": "Chris Cole",
      "id": 5,
      "photo": "",
      "bio": ""
    },
    {
      "email": "chris@email.com",
      "name": "Ishod Ware",
      "id": 6,
      "photo": "",
      "bio": ""
    }
  ],
  "tricks": [
    {
      "id": 1,
      "name": "Ollie",
      "type": "Basic",
      "difficulty": 1,
      "description": "The skateboard ollie is when you jump and the board sticks to your feet. You can learn how to ollie right here.",
      "tips": [
        "Place your feet",
        "Crouch at the knees",
        "Jump fast",
        "Pop hard at the same time",
        "Rise with the board",
        "Level it out a bit",
        "Land on the board and crouch for balance"
      ],
      "gif": "https://media.giphy.com/media/0zByWdONVTE9K9nGGM/giphy.gif",
      "yt": "QkeOAcj8Y5k"
    },
    {
      "id": 2,
      "name": "Pop Shuvit",
      "type": "Flip",
      "difficulty": 2,
      "description": "A flat board spin while doing an ollie. This trick can spin 180, 360, 540 or more.",
      "tips": [
        "When you pop the ollie you need to scoop forward your back foot and move your front foot back slower and level.",
        "When popping you want to jump backward to stay over the board.",
        "Once in the air pull your feet up and out of the way.",
        "When the board has rotated almost 180-degrees throw your feet at it and catch it.",
        "Once you catch it you can land and roll away."
      ],
      "gif": "https://thumbs.gfycat.com/WideeyedDistinctBrahmancow-size_restricted.gif",
      "yt": "DwCJvALEJWk"
    },
    {
      "id": 3,
      "name": "Kickflip",
      "type": "Flip",
      "difficulty": 3,
      "description": "Do an ollie, use your toe to flip the board one full rotation and land on it. Next to the ollie a kickflip is the biggest skateboard trick there is. Every skater wants to do it. Flip tricks are what makes skateboard tricks popular. When you see someone jump and flip the board using only their feet. It is something just a little magical.",
      "tips": [
        "Pop the board with a good size ollie.",
        "While popping flick your toe off the edge towards the nose. The timing and angle will take a while to figure out. Experiment with it.",
        "Once you have started the flip follow through with your front foot and hold it out over the board.",
        "Stay in the air long enough for the flip to happen.",
        "When you see the grip tape coming back around throw both your feet at the board and land on it.",
        "At first you need to be deliberate and throw your feet at the board to catch it. Soon it will become second nature."
      ],
      "gif": "https://thumbs.gfycat.com/AngelicWarpedGaur-size_restricted.gif",
      "yt": "YOf0XeI7KzU"
    },
    {
      "id": 4,
      "name": "Manual",
      "type": "Basic",
      "difficulty": 1,
      "description": "aka a wheelie. Rolling on the back two wheels of the skateboard. A fun trick that requires a lot of balance. Hold the manual as long as you can.",
      "tips": [
        "To do a manual you need to find your balance over the back wheels.",
        "Place you foot on the tail kick.",
        "Then put more weight on the tail to lift it.",
        "There is a sweet spot with the wheels and tail in the air. You need to find that spot and try to hold it."
      ],
      "gif": "https://thumbs.gfycat.com/SmoothInbornGonolek-size_restricted.gif",
      "yt": "1BTeDCziNdc"
    },
    {
      "id": 5,
      "name": "Drop In",
      "type": "Basic",
      "difficulty": 2,
      "description": "From tail stall at the top of a ramp. Dropping the front wheels down and rolling into the ramp. Scary!",
      "tips": [
        "Put the board on the coping with the tail on top and the wheels sort of snug on the ramp. - Put your feet on the board in a comfortable riding stance. With your back foot on the tail and your front foot on the front area of the board.",
        "You need to be able to stand there will most of your weight on the back foot and the front foot firmly planted on the deck. The key is to stand there in position comfortably. Do not through your foot on the front just before you drop in. If you miss the deck then you will eat the concrete. Plant the front foot where you want it and stay in position. This can be done as you get more comfortable with the trick.",
        "You want to tip your wheels and body into the ramp until you are perpendicular with the angle of the ramp. Just like you would be when rolling on flat. To do this tip over into the ramp like a teapot pouring. Shoulders, hips, feet and board all in line. You will tip until your wheels hit and your body in perpendicular with the ramp.",
        "When your wheels hit crouch your kness a bit and just roll away like you would when pumping the ramp."
      ],
      "gif": "https://thumbs.gfycat.com/GrandBruisedComet-size_restricted.gif",
      "yt": "SL96UBnmVZE"
    },
    {
      "id": 6,
      "name": "Boardslide",
      "type": "Grind",
      "difficulty": 4,
      "description": "Sliding on the center of the board between the trucks facing forwards.",
      "tips": [
        "Facing away from the curb, roll at the curb at a 45 ° angle.",
        "Place your back foot on the tail and your front foot in front of the hardware partly on the nose.",
        "When you get close lift the front wheels up enough to get them over the curb.",
        "Let the wheels clear the curb, then put the front down.",
        "Connect the deck with the curb.",
        "Pull the back wheels up and start sliding. You will slide faster than you roll so be ready for it.",
        "Turn the board perpendicular to the curb.",
        "Stay on the middle of the concave slightly on your heels. Too much on your toes and you will grip, stop and fall forward head over heals. Too much on your heels and the board will slide out from under you. Letting you land on the curb on your butt. That is painful.",
        "Stay in the slide. It's super fun.",
        "Compress your knees to maintain balance.",
        "Slide right to the end and place more weight on your back wheels.",
        "When you get off the end you want your back wheels to land first allowing you to turn out and roll away."
      ],
      "gif": "https://thumbs.gfycat.com/HarmlessImmaterialErin-size_restricted.gif",
      "yt": "qbgSHHP9VEo"
    },
    {
      "id": 7,
      "name": "50-50",
      "type": "Grind",
      "difficulty": 4,
      "description": "The 50-50 grind is where both trucks are grinding on the edge. 50% on the front truck and 50% on the back truck",
      "tips": [
        "Roll toward the curb at less than a 30° angle with some speed.",
        "When you get within 6”[150mm] start to ollie.",
        "Ollie up onto the curb aiming your back truck at the corner. Aim that truck to land with the hanger on the corner. You want the truck to lock in with the wheel pushed right up to the curb.",
        "Put that front truck down on the hanger too.",
        "Get your weight more on the back truck to keep the grind going.",
        "Grind until you stop.",
        "Then just turn out with a kickturn or pop."
      ],
      "gif": "https://media.giphy.com/media/2tTkJ5Hna6rhiNa6I2/giphy.gif",
      "yt": "bYkdJnkaxh8"
    },
    {
      "id": 8,
      "name": "Frontside 180 Ollie",
      "type": "Basic",
      "difficulty": 2,
      "description": "An air or ollie where the skater and board spin a half rotation. You will take off going your normal stance and land switch or fakie.",
      "tips": [
        "Place your back foot in ollie position.",
        "Place your front foot close to ollie position with you toe hanging over the toeside of the board about an inch.",
        "When crouching to ollie turn your front shoulder toeside towards the back. You want to wind your body up for the coming rotation.",
        "As you start to jump for the ollie turn your body frontside. Look frontside letting your shoulders and the rest of your body follow the rotation.",
        "Pop the board and begin the ollie.",
        "Your feet will follow the rest of your body in frontside rotation.",
        "To land put down the front truck.",
        "You can finish up the rotation by pivoting around on the front truck."
      ],
      "gif": "https://thumbs.gfycat.com/SecondarySickIceblueredtopzebra-size_restricted.gif",
      "yt": "ZSe9vPoXKiU"
    },
    {
      "id": 9,
      "name": "Backside 180 Ollie",
      "type": "Basic",
      "difficulty": 2,
      "description": "An air or ollie where the skater and board spin a half rotation. You will take off going your normal stance and land switch or fakie.",
      "tips": [
        "Place your back foot in ollie position.",
        "Place your front foot close to ollie position.",
        "When crouching to ollie turn your front shoulder heelside. Face away from the direction you are rolling. You want to wind your body up for the coming rotation.",
        "As you start to jump for the ollie turn your body backside. Look backwards letting your shoulders and the rest of your body follow the rotation.",
        "Pop the board and begin the ollie, you will be backwards in the air.",
        "Your feet will follow the rest of your body.",
        "To land put down the front truck.",
        "You can finish up the rotation by pivoting around on the front truck."
      ],
      "gif": "https://thumbs.gfycat.com/WellmadeTiredDiamondbackrattlesnake-size_restricted.gif",
      "yt": "IV27vYiLf6E"
    },
    {
      "id": 10,
      "name": "HeelfLip",
      "type": "Flip",
      "difficulty": 4,
      "description": "Using your heel to flip the board to the toe side while doing an ollie. This trick will come easy if you have mastered the kickflip.",
      "tips": [
        "Pop the board with a good size ollie and jump backwards to keep the board under you.",
        "Wait just a bit to get into the air. You need to give this trick time to get into the air before you flick.",
        "Flick your heel all the way over.",
        "Once you have started the flip, follow through with your front foot and hold it out over the board.",
        "Stay in the air long enough for the flip to happen. It will happen under you so you can't see it well. You might need to adjust the height of your jump or suck your legs up to give you more time. With heelflips you need to jump backwards just a little.",
        "When you see the grip tape coming back around throw both your feet at the board and land on it."
      ],
      "gif": "https://thumbs.gfycat.com/AnyInsistentHoneybee-size_restricted.gif",
      "yt": "phsJk5_jHkU"
    },
    {
      "id": 11,
      "name": "Tic Tac",
      "type": "Basic",
      "difficulty": 1,
      "description": "Several small kickturns back and forth. Pushing forward with each kick will give you speed.",
      "tips": [
      "Get rolling.",
      "Do a few small kickturns back and forth.",
      "When you do the turn push extra hard off the ground. Do these like you are paddling in a canoe.",
      "Paddle each side and then drop the wheels down before you turn too much."
      ],
      "gif": "https://thumbs.gfycat.com/AnyInsistentHoneybee-size_restricted.gif",
      "yt": "phsJk5_jHkU"
    },
    {
      "id": 12,
      "name": "Backside Flip",
      "type": "Flip",
      "difficulty": 4,
      "description": "A backside 180 ollie with a kickflip.",
      "tips": [
        "Backside flips are not tough to learn if you can do the three set up tricks. It is really just timing the body rotation, pop and flip together.",
        "You must be rolling to try this trick. As you should be with any trick. When you land you might not get the full 180° rotation with the board and your body. Just slide out the wheels the rest of the way.",
        "Getting better you will be able to land on the front trucks and pivot out the rest of the way.",
        "As you practice this trick it will get easier and easier to pull around. That is when you will develop your style of doing it.",        
        "If the board starts to get away behind you when it flips. To stay over top of the board. Try leaning backwards into the trick a little more, pop straight up and higher. This will help keep it under your body through the trick."
      ],
      "gif": "https://thumbs.gfycat.com/AnyInsistentHoneybee-size_restricted.gif",
      "yt": "phsJk5_jHkU"
    },
    {
      "id": 13,
      "name": "Frontside Flip",
      "type": "Flip",
      "difficulty": 4,
      "description": "A frontside 180 ollie with a kickflip. A trick with a lot of variations.",
      "tips": [
        "When you flick the flip it will go up through your legs a bit.",
        "Let it go through and then catch it. Land on it and roll away.",
        "If you hold the front foot out the board should move to meet it in the air. This can look a lot like a hardflip.",
        "If done with weird style it will look like an illusion flip. Kind of like a funny pop shuvit like flip."
      ],
      "gif": "https://thumbs.gfycat.com/AnyInsistentHoneybee-size_restricted.gif",
      "yt": "phsJk5_jHkU"
    },
    {
      "id": 14,
      "name": "Inward HeelFlip",
      "type": "Flip",
      "difficulty": 4,
      "description": "A backside pop shuvit heelflip.",
      "tips": [
        "Throw a backside heelflip but don’t turn your body.",
        "This trick has a subtle flick. You need to flip the board inward to the shuvit.  Which means you need to flick the flip before the shuvit is flicked.",
        "Instead of messing with all the timing, do a backside heelflip which is an easier flick. Then keep the top of your body from turning backside."
      ],
      "gif": "https://thumbs.gfycat.com/AnyInsistentHoneybee-size_restricted.gif",
      "yt": "phsJk5_jHkU"
    },
    {
      "id": 15,
      "name": "HardFlip",
      "type": "Flip",
      "difficulty": 4,
      "description": "A frontside pop shuvit kickflip.",
      "tips": [
        "This trick is very similar to a frontside flip. The only real difference is that your body does not rotate. So learn frontside flips first.",
        "When you pop this trick get the flat rotation spinning before you hit the tail on the ground.",
        "Once the board is in the air flick the flip.",
        "The board will flip between your legs and underneath you. You can't see it very well during this trick. Just trust that it is there. When you get a good flip you can usually feel it without actually seeing it."
      ],
      "gif": "https://thumbs.gfycat.com/AnyInsistentHoneybee-size_restricted.gif",
      "yt": "phsJk5_jHkU"
    },
    {
      "id": 16,
      "name": "360 Flip",
      "type": "Flip",
      "difficulty": 4,
      "description": "Aka 360 Kickflip/ 3 Flip/ Tre Flip. A backside 360 shuvit kickflip.",
      "tips": [
        "The trick to this is starting the flat spin early, staying over top and not kicking to hard.",
        "Put your feet in kickflip position and then move your front foot back to the center of the board. Put your back foot so the toe is hanging off the edge of the tail a little bit.",
        "When you begin the pop you want to start the rotation early. When the board hits the ground you want the flat spin to be at a 45 degree angle.",
        "Give it a pretty high ollie pop so that there is enough time for the board to rotate under you. Make sure you pop straight up so that it says under you too.",
        "Flick like a kickflip with the front foot. Don't flick too hard. If your timing is right that board will spin smoothly without a lot of effort."
      ],
      "gif": "https://thumbs.gfycat.com/AnyInsistentHoneybee-size_restricted.gif",
      "yt": "phsJk5_jHkU"
    },
    {
      "id": 17,
      "name": "Noseslide",
      "type": "Grind",
      "difficulty": 3,
      "description": "A slide with the nose of the skateboard on the edge.",
      "tips": [
        "To do a noseslide you must put all your weight on the nose and slide. During the ollie you pop from the tail and then shift all you weight to the nose to land on the edge.",
        "At first it will be helpful not to ollie into this trick and try it into a stall. The weight shift from the tail to the nose is key. It will take time to get this and be able to ollie into a noseslide.",
        "Once locked in this is a stable trick. The nose of the skateboard is flat from side to side. Unlike a boardslide where you need to balance on the concave of the deck. You will be doing many of the same things that you learned with the boardslide. The major difference is where you land and how much you need to shift your weight.",
        "You will land on the nose and slide on the deck, wheels and even some of the truck. The board position is key to letting you slide. The wheels are grippy and if they rub the edge at the wrong angle they will stick."
      ],
      "gif": "https://thumbs.gfycat.com/AnyInsistentHoneybee-size_restricted.gif",
      "yt": "phsJk5_jHkU"
    },
    {
      "id": 18,
      "name": "Tailslide",
      "type": "Grind",
      "difficulty": 3,
      "description": "A slide where you ollie with the tail and land with the tail on the edge.",
      "tips": [
        "Roll toward the curb at about 30°.",
        "Get in 180 ollie position.",
        "Wrap your shoulders up to rotate the 180 ollie.",
        "When you get within 6” [150mm] start to unwrap the ollie.",
        "You want to pop the board high enough to get the back truck up onto the corner.",
        "In an alley oop motion go up and then use the downward fall to plant the tail down.",
        "Land the tail onto the corner and put all your weight there.",
        "Use the front foot just to hold the board in place.",
        "Crouch your legs a lot to absorb the impact and motion. Your weight will be going past the curb. Try to control it and let it center up above the tail. It should feel pretty good to lock in."
      ],
      "gif": "https://thumbs.gfycat.com/AnyInsistentHoneybee-size_restricted.gif",
      "yt": "phsJk5_jHkU"
    },
    {
      "id": 19,
      "name": "Crooked Grind",
      "type": "Grind",
      "difficulty": 3,
      "description": "Aka Crooks, Pointer Grind, or the K-grind. Named for Eric Koston. A front truck grind where the nose touches and the front truck is pushed all the way crooked with all of the weight on the hanger right by the wheel. The board is posed crooked. The truck looks crooked.",
      "tips": [
        "With the grind edge behind you",
        "Roll in ollie position with good speed parallel with the edge",
        "Ollie and land the nose and front truck on the edge at a 45° angle.",
        "Be heavy on the hanger and light on the nose. Too much weight on the nose and it will stick.",
        "As you lock in pinch the heelside wheel.",
        "Hold this while grinding.",
        "Pop a nollie off to clear the back wheels."
      ],
      "gif": "https://thumbs.gfycat.com/AnyInsistentHoneybee-size_restricted.gif",
      "yt": "phsJk5_jHkU"
    },
    {
      "id": 20,
      "name": "Smith Grind",
      "type": "Grind",
      "difficulty": 3,
      "description": "The back truck grinds the edge, while the front truck hangs down below the near side of the object.",
      "tips": [
        "Roll toward the curb at less than a 30° angle with some speed.",
        "Ollie up onto the edge aiming your back truck at the corner. Aim that truck to land with the hanger on the corner. You want the truck to lock in with the wheel under the heel pushed right up to the grind edge.",
        "You will start grinding right away.",
        "Angle the front away from the edge.",
        "Put the truck down below the edge.",
        "The deck rail between your toes will touch the edge and can slide.",
        "Crouch those legs to adjust your balance and feel the grind.",
        "Grind until you stop or come to the end of the grind edge.",
        "Pop a small ollie out."
      ],
      "gif": "https://thumbs.gfycat.com/AnyInsistentHoneybee-size_restricted.gif",
      "yt": "phsJk5_jHkU"
    }
  ],
  "entries": [
    {
      "id": 5,
      "userId": 1,
      "date": "2021-04-30",
      "mood": "Confident",
      "entry": "Testing  3",
      "timestamp": 1619797506442
    },
    {
      "id": 6,
      "userId": 1,
      "date": "2021-04-30",
      "mood": "Confident",
      "entry": "Landed my first pop shuvit today!!!!!!!",
      "timestamp": 1619797418985
    },
    {
      "userId": 2,
      "timestamp": 1619795110247,
      "date": "2021-04-30",
      "mood": "Confident",
      "entry": "Testing 2",
      "id": 7
    }
  ],
  "practice": [
    {
      "id": 1,
      "userId": 1,
      "trickId": 2,
      "isComplete": false
    },
    {
      "id": 3,
      "userId": 1,
      "trickId": 1,
      "isComplete": true
    },
    {
      "userId": 2,
      "trickId": 3,
      "isComplete": true,
      "id": 6
    },
    {
      "id": 7,
      "userId": 2,
      "trickId": 10,
      "isComplete": false
    },
    {
      "userId": 2,
      "trickId": 6,
      "isComplete": true,
      "id": 8
    },
    {
      "userId": 2,
      "trickId": 1,
      "isComplete": true,
      "id": 9
    },
    {
      "userId": 2,
      "trickId": 8,
      "isComplete": true,
      "id": 11
    },
    {
      "userId": 2,
      "trickId": 5,
      "isComplete": true,
      "id": 12
    },
    {
      "userId": 2,
      "trickId": 2,
      "isComplete": true,
      "id": 13
    },
    {
      "userId": 1,
      "trickId": 5,
      "isComplete": false,
      "id": 14
    },
    {
      "userId": 2,
      "trickId": 4,
      "isComplete": false,
      "id": 15
    }
  ],
  "friends": [
    {
      "currentUserId": 1,
      "userId": 2,
      "id": 1
    },
    {
      "currentUserId": 2,
      "userId": 1,
      "id": 2
    },
    {
      "currentUserId": 2,
      "userId": 3,
      "id": 3
    },
    {
      "currentUserId": 1,
      "userId": 4,
      "id": 4
    }
  ]
}